Revit 2027 API
LayoutRuleClearSpacing Constructor
Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LayoutRuleClearSpacing(
	double spacing,
	BeamSystemJustifyType justifyType
)
Public Sub New (
	spacing As Double,
	justifyType As BeamSystemJustifyType
)
public:
LayoutRuleClearSpacing(
	double spacing,
	BeamSystemJustifyType justifyType
)
new :
        spacing : float *
        justifyType : BeamSystemJustifyType -> LayoutRuleClearSpacing
Parameters
spacing Double
 The value of spacing must be in [0, 30000).
justifyType BeamSystemJustifyType
 The type of the justification, it's corresponding to the items in the element properties dialog.
Remarks
The value of spacing must be in [0, 30000), but in fact the spacing should not be too small or too great.
See Also
Reference
LayoutRuleClearSpacing Class
Autodesk.Revit.DB Namespace